In [99]:
#Pandas assignment 
#1. find the net salary after 30% deduction of tax
#2. remove all the rows having Null values
#3. Filter the salaries of people where name starts with S
#4. create another column Int_Sal where salary is stored as integer type
#5. Find the name of employee having maximum salary
#6. Filter the salaries of employees having n in the last
#7. Count the number of salaries where null values are not there
#8. Sort the data based on Name
#9. filter the names of employees where salary is between 400000 and 600000
#10. Find the Mean salary from the salary colum
import pandas as pd 
import numpy as np 
import re
df=pd.read_csv("D:\\study\\python\\data\\student2.csv",header=0)
print(df)

     Name        Salary
0    Amit     $100,000
1   Sumit     $200,000
2   Suman     $600,000
3   Kiran     $640,000
4    John     $300,000
5  Lokesh           NaN
6     NaN     $300,000
7    Amar           NaN
8     NaN  $600,000.00

In [117]:
#1. find the net salary after 30% deduction of tax
#df["Salary_int"]=df.Salary.apply(lambda x:x.replace("$","")).apply(lambda x:x.replace(",","")).astype(np.float)
df['NetSalary1']=df['Salary'].replace('[\$,]', '', regex=True).astype(float)
print(np.sum(df['NetSalary1'])*0.7)
#while using normal summation function sum it will print nan as some values are none 
#but while using np.sum it will ignore null values
#similarly replacing using regex will ignore the null values and will not terminate the programme

1917999.9999999998

In [74]:
#2. remove all the rows having Null values
df=df.dropna()
print(df)

    Name     Salary  NetSalary1
0   Amit  $100,000     100000.0
1  Sumit  $200,000     200000.0
2  Suman  $600,000     600000.0
3  Kiran  $640,000     640000.0
4   John  $300,000     300000.0

In [82]:
#3. Filter the salaries of people where name starts with S
#ans1
for value in df.Name:
    if value[0]=="S":
        print(value)
#ans2
#dd = df[df.Name.str[0]=='S']
#print dd.head(10)dd = df[df.Name.str[0]=='S']
#print dd.head(10)

Sumit
Suman

In [118]:
#4. create another column Int_Sal where salary is stored as integer type
#here net salary is in float we have to downcast it to a lower value 
df["Int_sal"]=pd.to_numeric(df.NetSalary1,downcast="integer",errors="ignore")
print(type(df.Int_sal))

<class 'pandas.core.series.Series'>

In [89]:
#5. Find the name of employee having maximum salary
df[df.Salary==np.max(df.Salary)].Name

3    Kiran
Name: Name, dtype: object

In [95]:
#6. Filter the salaries of employees having n in the last
#ans1
"""
for line in df.Name:
    if line[-1]=="n":
        print(line)
"""
#ans2
df[df.Name.str[-1]=='n'].Salary

2    $600,000
3    $640,000
4    $300,000
Name: Salary, dtype: object

In [102]:
#7. Count the number of salaries where null values are not there
print(df.Salary.count())#this will show count  without null values 
print(len(df.Salary))#this will show count including null values

7
9

In [116]:
#8. Sort the data based on Name
df.sort_values(by="Name",ascending=True)
#help(df.sort_values)

     Name        Salary
7    Amar           NaN
0    Amit     $100,000
4    John     $300,000
3   Kiran     $640,000
5  Lokesh           NaN
2   Suman     $600,000
1   Sumit     $200,000
6     NaN     $300,000
8     NaN  $600,000.00

In [142]:
#9. filter the names of employees where salary is between 400000 and 600000
#ans1
"""
for val in df.Int_sal:
    if val>=400000 and val<=600000:
        print(df[df.Int_sal==val].Name)
"""
#ans2
df[(df.Int_sal>=400000) & ( df.Int_sal<=600000)].Name

2    Suman
8      NaN
Name: Name, dtype: object

In [143]:
#10. Find the Mean salary from the salary colum
np.mean(df.Int_sal)

391428.5714285714